* Indiana - LAUST180000000000003,LAUST180000000000004,LAUST180000000000005,LAUST180000000000006,LAUST180000000000007,LAUST180000000000008,LAUST180000000000009
* Marion Co - LAUCN180970000000003, LAUCN180970000000004, LAUCN180970000000005, LAUCN180970000000006
* Monroe Co - LAUCN181050000000003, LAUCN181050000000004, LAUCN181050000000005, LAUCN181050000000006
* St. Joseph Co - LAUCN181410000000003, LAUCN181410000000004, LAUCN181410000000005, LAUCN181410000000006

***
#### **Dependencies**

In [25]:
import bls
from blsconnect import RequestBLS, bls_search
import pandas as pd
from pandas import DataFrame, Series
from bs4 import BeautifulSoup
import requests
import dateutil
from datetime import datetime
#import datetime
import calendar
dict((v,k) for k,v in enumerate(calendar.month_abbr)) #from dateutil.rrule import *
#from dateutil.parser import *
#from datetime import *
import csv
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
import json

***
#### **U.S. BLS API KEY**

In [26]:
from config import BLS_API_KEY
bls = RequestBLS(key = BLS_API_KEY)

***
#### **United States Unemployment**

In [27]:
US_monthly_unemployment_rate_A = pd.DataFrame(bls.series(['LNS14000000'], 1948, 2020))

In [28]:
US_monthly_unemployment_rate_A.columns

Index(['year', 'period', 'periodName', 'LNS14000000'], dtype='object')

In [29]:
US_monthly_unemployment_rate_A.head(2)

   year period periodName  LNS14000000
0  1948    M01    January          3.4
1  1948    M02   February          3.8

In [30]:
#US_monthly_unemployment_rate.to_csv("temporary")

In [31]:
#tempA = pd.read_csv("temporary")

In [32]:
US_monthly_unemployment_rate_A.head(2)

   year period periodName  LNS14000000
0  1948    M01    January          3.4
1  1948    M02   February          3.8

In [33]:
US_monthly_unemployment_rate_A.dtypes

year             int64
period          object
periodName      object
LNS14000000    float64
dtype: object

In [34]:
US_monthly_unemployment_rate_A['temp_date'] = pd.to_datetime(US_monthly_unemployment_rate_A['periodName'], format='%B')
US_monthly_unemployment_rate_A['Month'] = US_monthly_unemployment_rate_A['temp_date'].dt.strftime('%m')
US_monthly_unemployment_rate_C = US_monthly_unemployment_rate_A
US_monthly_unemployment_rate_C.columns

Index(['year', 'period', 'periodName', 'LNS14000000', 'temp_date', 'Month'], dtype='object')

In [72]:
US_monthly_unemployment_rate_C.columns = ['Year','Period','periodName','Unemployment Rate','temp_date','Month']
US_monthly_unemployment_rate_D = US_monthly_unemployment_rate_C.drop(['Period','periodName','temp_date'], axis=1)
US_monthly_unemployment_rate_D.dtypes

Year                   int64
Unemployment Rate    float64
Month                 object
dtype: object

In [73]:
US_monthly_unemployment_rate_E = US_monthly_unemployment_rate_D
US_monthly_unemployment_rate_E['Year-Month'] = US_monthly_unemployment_rate_E["Year"].astype(str) + "-" + US_monthly_unemployment_rate_E["Month"] 
US_monthly_unemployment_rate_E.head(2)

   Year  Unemployment Rate Month Year-Month
0  1948                3.4    01    1948-01
1  1948                3.8    02    1948-02

In [74]:
US_monthly_unemployment_rate_E.dtypes

Year                   int64
Unemployment Rate    float64
Month                 object
Year-Month            object
dtype: object

In [75]:
US_monthly_unemployment_rate_D.to_json(r'json\US_monthly_unemployment_rate.json')

In [38]:
"""
US_monthly_unemployment_rate_A.index.names = ['Date']
US_monthly_unemployment_rate_B = US_monthly_unemployment_rate_A.sort_values(by='Date', ascending=True)
US_monthly_unemployment_rate_B.columns = ['Unemployment Rate']
US_monthly_unemployment_rate = US_monthly_unemployment_rate_B
US_monthly_unemployment_rate.head(2)
"""

"\nUS_monthly_unemployment_rate_A.index.names = ['Date']\nUS_monthly_unemployment_rate_B = US_monthly_unemployment_rate_A.sort_values(by='Date', ascending=True)\nUS_monthly_unemployment_rate_B.columns = ['Unemployment Rate']\nUS_monthly_unemployment_rate = US_monthly_unemployment_rate_B\nUS_monthly_unemployment_rate.head(2)\n"

#### **Indiana Unemployment**

In [39]:
Indiana_monthly_unemployment_stats = pd.DataFrame(bls.series(['LAUST180000000000003','LAUST180000000000004','LAUST180000000000005','LAUST180000000000006'
                                                              ,'LAUST180000000000007','LAUST180000000000008','LAUST180000000000009'], 1990, 2020))

In [40]:
#Indiana_monthly_unemployment_stats.index.names = ['Date']
Indiana_monthly_unemployment_stats.columns = ['Year','Period','periodName','Unemployment Rate','Unemployed','Employed','Labr Force'
                                              ,'Employement-Population Ratio','Labor Force Participation Rate','Civilian Noninstitutional Population']
Indiana_monthly_unemployment_stats.to_json(r'json\Indiana_monthly_unemployment_stats.json')
Indiana_monthly_unemployment_stats.head(2)

,Year,Period,periodName,Unemployment Rate,Unemployed,Employed,Labr Force,Employement-Population Ratio,Labor Force Participation Rate,Civilian Noninstitutional Population
0,1990,M01,January,5.8,163676,2655784,2819460,64.4,68.4,4124937
1,1990,M02,February,6.1,170367,2640518,2810885,63.8,67.9,4137185

#### **Monroe Co Unemployment**

In [41]:
Monroe_Co_unemployment_stats = pd.DataFrame(bls.series(['LAUCN181050000000003', 'LAUCN181050000000004', 'LAUCN181050000000005', 'LAUCN181050000000006'], 1990, 2020))

In [42]:
#Monroe_Co_unemployment_stats.index.names = ['Date']
Monroe_Co_unemployment_stats.columns = ['Year','Period','periodName','Unemployment Rate', 'Unemployed', 'Employed','Labor Force']
Monroe_Co_unemployment_stats.to_json(r'json\Monroe_Co_unemployment_stats.json')
Monroe_Co_unemployment_stats.head(2)
#Monroe_Co_unemployment_stats.columns

,Year,Period,periodName,Unemployment Rate,Unemployed,Employed,Labor Force
0,1990,M01,January,3.0,1642,53672,55314
1,1990,M02,February,3.7,2053,53694,55747

#### **Marion Co Unemployment**

In [43]:
Marion_Co_unemployment_stats = pd.DataFrame(bls.series(['LAUCN180970000000003', 'LAUCN180970000000004', 'LAUCN180970000000005', 'LAUCN180970000000006'], 1990, 2020))

In [44]:
#Marion_Co_unemployment_stats.index.names = ['Date']
Marion_Co_unemployment_stats.columns = ['Year','Period','periodName','Unemployment Rate', 'Unemployed', 'Employed','Labor Force']
Marion_Co_unemployment_stats.to_json(r'json\Marion_Co_unemployment_stats.json')
Marion_Co_unemployment_stats.head(2)

,Year,Period,periodName,Unemployment Rate,Unemployed,Employed,Labor Force
0,1990,M01,January,3.8,16223,406469,422692
1,1990,M02,February,4.0,16965,405270,422235

#### **St. Joseph Co Unemployment**

In [45]:
StJospeh_Co_unemployment_stats = pd.DataFrame(bls.series(['LAUCN181410000000003', 'LAUCN181410000000004', 'LAUCN181410000000005', 'LAUCN181410000000006'], 1990, 2020))

In [46]:
#StJospeh_Co_unemployment_stats.index.names = ['Date']
StJospeh_Co_unemployment_stats.columns = ['Year','Period','periodName','Unemployment Rate', 'Unemployed', 'Employed','Labor Force']
StJospeh_Co_unemployment_stats.to_json(r'json\StJospeh_Co_unemployment_stats.json')
StJospeh_Co_unemployment_stats.head(2)

,Year,Period,periodName,Unemployment Rate,Unemployed,Employed,Labor Force
0,1990,M01,January,5.4,6791,119402,126193
1,1990,M02,February,6.7,8512,118213,126725

***
#### **United States Weekly New Jobs Claims**
***

In [47]:
US_weekly_new_jobs_claims = pd.read_csv("data/r539cy_BLS_Weekly_Jobs_Claims_US.csv")
US_weekly_new_jobs_claims.head(2)

         Date Weekly Jobs Claims
0  1967-01-07            208,000
1  1967-01-14            207,000

***
#### **Indiana Weekly New Jobs Claims**
***

In [48]:
IN_weekly_new_jobs_claims = pd.read_csv("data/r539cy_BLS_Weekly_Jobs_Claims_Indiana.csv")
IN_weekly_new_jobs_claims.head(2)

,State,Filed week ended,Initial Claims,Reflecting Week Ended,Continued Claims,Covered Employment,Insured Unemployment Rate
0,Indiana,1987-01-03,"10,068",1986-12-27,"47,604","2,065,922",2.30
1,Indiana,1987-01-10,"16,812",1987-01-03,"63,290","2,078,050",3.05

***
#### **Marion County Weekly New Jobs Claims**
***

In [49]:
MarionCo_weekly_new_jobs_claims = pd.read_csv("data/r539cy_BLS_Weekly_Jobs_Claims_IN_MarionCo.csv")
MarionCo_weekly_new_jobs_claims.head(2)

           Geography        Date Initial Claims
0  Marion County, IN  2020-03-07            298
1  Marion County, IN  2020-03-14            425

***
#### **Monroe County Weekly New Jobs Claims**
***

In [50]:
MonroeCo_weekly_new_jobs_claims = pd.read_csv("data/r539cy_BLS_Weekly_Jobs_Claims_IN_MonroeCo.csv")
MonroeCo_weekly_new_jobs_claims.head(2)

           Geography        Date Initial Claims
0  Monroe County, IN  2020-03-07             21
1  Monroe County, IN  2020-03-14             18

***
#### **St. Joseph County Weekly New Jobs Claims**
***

In [51]:
StJosephCo_weekly_new_jobs_claims = pd.read_csv("data/r539cy_BLS_Weekly_Jobs_Claims_IN_StJosephCo.csv")
StJosephCo_weekly_new_jobs_claims.head(2)

               Geography        Date Initial Claims
0  St. Joseph County, IN  2020-03-07            110
1  St. Joseph County, IN  2020-03-14            113

***
#### **Henry County Weekly New Jobs Claims**
***

In [52]:
HenryCo_weekly_new_jobs_claims = pd.read_csv("data/r539cy_BLS_Weekly_Jobs_Claims_IN_HenryCo.csv")
HenryCo_weekly_new_jobs_claims.head(2)

          Geography        Date  Initial Claims
0  Henry County, IN  2020-03-07              10
1  Henry County, IN  2020-03-14              14

***
#### **Indiana COVID-19 Cases**
***

In [53]:
IN_COVID_19_Cases_A = pd.read_csv("data/Indiana_COVID-19_Cases_ by_Day-COVID_Cases_Total_by_Day.csv")
IN_COVID_19_Cases_A.columns = ['County','GeoID','2020-03-06','2020-03-07','2020-03-08','2020-03-09','2020-03-10','2020-03-11','2020-03-12','2020-03-13'
                            ,'2020-03-14','2020-03-15','2020-03-16','2020-03-17','2020-03-18','2020-03-19','2020-03-20','2020-03-21','2020-03-22','2020-03-23'
                            ,'2020-03-24','2020-03-25','2020-03-26','2020-03-27','2020-03-28','2020-03-29','2020-03-30','2020-03-31'
                            ,'2020-04-01','2020-04-02','2020-04-03','2020-04-04']

In [54]:
IN_COVID_19_Cases = IN_COVID_19_Cases_A.replace(np.nan, "N/A")
IN_COVID_19_Cases.head(2)

,County,GeoID,2020-03-06,2020-03-07,2020-03-08,2020-03-09,2020-03-10,2020-03-11,2020-03-12,2020-03-13,...,2020-03-26,2020-03-27,2020-03-28,2020-03-29,2020-03-30,2020-03-31,2020-04-01,2020-04-02,2020-04-03,2020-04-04
0,Adams County,18001,N/A,N/A,N/A,N/A,1,1,1,1,...,1,1,1,1,1,1,1,1,1,2
1,Allen County,18003,N/A,N/A,N/A,N/A,N/A,N/A,N/A,N/A,...,8,21,23,26,28,30,39,46,58,59

***
### **PLOTS**
***